# G2M insight for Cab Investment firm

## Introduction

As of 2022, the market size of the Cab industry in the USA exceeds $44.0bn and is expected to grow further.It has multiple key players and the XYZ investment firm is planning to invest in one of them. The aim of this report is to provide an understanding of the market and to identify the right company to invest in between the two candidates of Pink Cab and Yellow Cab. The report makes use of 4 provided datasets containing data gathered from 31/01/2016 to 31/12/2018 and document:
* customer details of the 2 companies
* cab ride details of the 2 companies
* transactions details of the rides
* demographic and cab usage information on USA cities

## Understanding the Datasets

In [259]:
import pandas as pd
import xlrd
from datetime import datetime

In [260]:
cab_data = pd.read_csv("Cab_data.csv")
tr_id = pd.read_csv("Transaction_ID.csv")
cust_id = pd.read_csv("Customer_ID.csv")
city = pd.read_csv("City.csv")

#### Cab_data dataset

In [261]:
cab_data.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776

We see that we need to convert excel date format to datetime object

In [262]:
cab_data["Date of Travel"] = cab_data["Date of Travel"].apply(lambda x: xlrd.xldate.xldate_as_datetime(x, 0))

In [263]:
cab_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  datetime64[ns]
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(2)
memory usage: 19.2+ MB

We see that we have no missing values in any column and that the data types are correct.

In [264]:
cab_data["City"].value_counts()

NEW YORK NY       99885
CHICAGO IL        56625
LOS ANGELES CA    48033
WASHINGTON DC     43737
BOSTON MA         29692
SAN DIEGO CA      20488
SILICON VALLEY     8519
SEATTLE WA         7997
ATLANTA GA         7557
DALLAS TX          7017
MIAMI FL           6454
AUSTIN TX          4896
ORANGE COUNTY      3982
DENVER CO          3825
NASHVILLE TN       3010
SACRAMENTO CA      2367
PHOENIX AZ         2064
TUCSON AZ          1931
PITTSBURGH PA      1313
Name: City, dtype: int64

In [265]:
cab_data["Company"].value_counts()

Yellow Cab    274681
Pink Cab       84711
Name: Company, dtype: int64

Further investigation of columns of 'object' type shows no errors.

In [266]:
cab_data.nunique()

Transaction ID    359392
Date of Travel      1095
Company                2
City                  19
KM Travelled         874
Price Charged      99176
Cost of Trip       16291
dtype: int64

We observe that transaction id's are all unique so the dataset doesn't contain any duplicate transactions. Moreover, 1095 days correspond exactly to 3 years (2016-2018) so data from every day has been gathered.

In [267]:
cab_data[["KM Travelled", "Price Charged", "Cost of Trip", "Date of Travel"]].describe(datetime_is_numeric = True).round(2)

,KM Travelled,Price Charged,Cost of Trip,Date of Travel
count,359392.00,359392.00,359392.00,359392
mean,22.57,423.44,286.19,2017-08-17 01:37:55.042293760
min,1.90,15.60,19.00,2016-01-02 00:00:00
25%,12.00,206.44,151.20,2016-11-23 00:00:00
50%,22.44,386.36,282.48,2017-09-10 00:00:00
75%,32.96,583.66,413.68,2018-05-12 00:00:00
max,48.00,2048.03,691.20,2018-12-31 00:00:00
std,12.23,274.38,157.99,NaN

#### Transaction_Id Dataset

In [268]:
tr_id.head()

   Transaction ID  Customer ID Payment_Mode
0        10000011        29290         Card
1        10000012        27703         Card
2        10000013        28712         Cash
3        10000014        28020         Cash
4        10000015        27182         Card

In [269]:
tr_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

In [270]:
tr_id["Payment_Mode"].value_counts()

Card    263991
Cash    176107
Name: Payment_Mode, dtype: int64

In [271]:
tr_id.nunique()

Transaction ID    440098
Customer ID        49171
Payment_Mode           2
dtype: int64

Again we have no missing values, the data types are correct and there are no duplicates.

#### Customer_ID Dataset

In [272]:
cust_id.head()

   Customer ID Gender  Age  Income (USD/Month)
0        29290   Male   28               10813
1        27703   Male   27                9237
2        28712   Male   53               11242
3        28020   Male   23               23327
4        27182   Male   33                8536

In [273]:
cust_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB